Revit 2016 API
BuiltInFailures.MEPFabricationFailures Properties
The BuiltInFailures.MEPFabricationFailures type exposes the following members.
Properties
Name | Description
CannotConvertFlexPipeToPart
 Cannot convert flex pipe to fabrication part.
CannotMatchFabricationHangerSizeToHost
 The hanger cannot be re-sized to match the re-sized host.
FabDbChangeConn
 Fabrication Database changes altered connectivity
FabDbOpenJobConn
 Fabrication job imported had bad connectivity
FabricationConfigurationCorrupted
 It looks that the Fabrication Configuration %1!s! was corrupted, please check it at %2!s!.
FabricationHangerCannotBeSloped
 A hanger cannot be sloped or placed on a sloped element.
FabricationHangerHostNotFound
 The hanger will disconnect because we can't find the suitable host.
FabricationHangerNotConnectToHost
 Fabrication Hanger didn't connect to the %s host.
FabricationHangerOutOfHost
 The hanger is out of its host and will be disconnected.
FabricationHangerSizeNotMatch
 The hanger size does not match the size of the host, so it can not be connected.
FabricationPartCannotBeMirrored
FabricationPartHasInvalidGeometry
 The fabrication part either has no material or has badly configured dimensions, resulting in bad geometry.
FabricationPartInvalidConnection
 Fabrication Part connection invalid and could not be automatically coupled.
FabricationPartNoPartTypeFound
 There are no fabrication part types found for the current Configuration and Service. Please select settings and reload the service to create the fabrication part types.
FabricationRodsConnectionChangedWarning
 The structural component that the hanger is attached to has changed to a different element.
FabricationRodsDisconnectedError
 The hanger rod was disconnected because there is no structural component above.
FabricationRodsDisconnectedWarning
 The hanger rod was disconnected because there is no structural component above.
NoStructuralHostToAttachWarning
 There is no structural component to attach the hanger rod to.
PlaceCutinFittingFailed
 Failed to insert part.
SizeNotAvailableInFabricationService
 Sizes:%1!s! in system %2!s! are not available in fabrication service:%3!s!, All available sizes are:\n%4!s!.
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace